//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : GP11A132 AUNGPYAESAN
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct TITLE
{
	D3DXVECTOR3		pos;			// ポリゴンの座標
	float			w, h;			// 幅と高さ
	float			u, v, uw, vh;	// テキスチャーのUVWH
	int				texNo;			// 使用しているテクスチャ番号

};

enum
{
	LAYER_1,
	LAYER_2,
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);


